export const groups = [
  { value: 'sahn', label: 'صحن' },
  { value: 'eyvan', label: 'ایوان' },
  { value: 'ravaq', label: 'رواق' },
  { value: 'masjed', label: 'مسجد' },
  { value: 'madrese', label: 'مدرسه' },
  { value: 'khadamat', label: 'خدماتی' },
  { value: 'elmi', label: 'علمی/آموزشی/فرهنگی' },
  { value: 'cemetery', label: 'آرامستان' },
  { value: 'other', label: 'سایر' },
];

export const subGroups = {
  sahn: ['صحن انقلاب', 'صحن آزادی', 'صحن جمهوری اسلامی', 'صحن قدس', 'صحن جامع رضوی', 'صحن غدیر', 'صحن کوثر', 'صحن امام حسن مجتبی', 'صحن پیامبر اعظم'],
  eyvan: ['ایوان عباسی', 'ایوان طلایی', 'ایوان ساعت', 'ایوان نقاره', 'ایوان ولیعصر', 'ایوان طلای آزادی'],
  ravaq: ['دارالحفاظ', 'دارالسياده', 'دارالسلام', 'حاتم خانی', 'گنبدالله وردی خان', 'دارالضیافه', 'توحیدخانه', 'دارالفیض', 'دارالسعاده', 'شیخ بهایی', 'دارالسرور', 'دارالشکر', 'دارالشرف', 'دارالعزه', 'دارالذکر', 'دارالزهد', 'دارالعباد', 'دارالولایه', 'دارالهدایه', 'دارالرحمه', 'دارلاخلاص', 'حضرت معصومه', 'دارالحکمه', 'دارالحجه', 'دارالکرامه', 'امام خمینی', 'شیخ طوسی', 'سیخ حر عاملی', 'حضرت فاطمه', 'دارالمرحمه', 'کوثر', 'غدیر'],
  masjed: ['مسجد گوهرشاد', 'مسجد بالاسر'],
  madrese: ['مدرسه پریزاد', 'مدرسه دودرب'],
  khadamat: ['دفاتر امانات', 'دفاتر اشیاء پیدا شده', 'دفاتر پیدا شدگان', 'دفاتر نذورات', 'دفاتر صندلی چرخدار', 'دفتر آگاهی', 'دفتر امور دفن', 'کفشداری', 'سرویس بهداشتی', 'مهمانسرا', 'امداد زائرین', 'دارالشفا', 'آرامستان', 'پارکینگ', 'چایخانه'],
  elmi: ['بنیاد پژوهش‌های اسلامی', 'دانشگاه علوم اسلامی رضوی', 'کتابخانه مرکزی', 'کتابخانه مسجد گوهرشاد', 'موزه مرکزی', 'موزه فرش', 'موزه قرآن'],
  cemetery: ['آرامستان امام رضا', 'آرامستان خواجه ربیع', 'آرامستان خواجه اباصلت'],
  other: ['سایر'],
};
